Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བཙལ་བ་གང་ཡིན་པའི་ཆོས་དེ་དག་ཐམས་ཅད་ནི་ལྡན་པ་ཡང་མ་ཡིན། མི་ལྡན་པ་ཡང་མ་ཡིན་ནོ། །གཟུགས་མེད་པ། བལྟར་མེད་པ། ཐོགས་པ་མེད་པ་མཚན་ཉིད་གཅིག་པ་སྟེ། འདི་ལྟར་མཚན་ཉིད་མེད་པའོ།
en: If you ask why, Kauśika, it is because all those phenomena—be they ‘physical forms,’ be they ‘feelings,’ ‘perceptions,’ ‘formative predispositions,’ or ‘consciousness’, be they ‘bodhisattvas,’ be they ‘the perfection of wisdom,’ or be they ‘the act of seeking’—are neither conjoined nor disjoined, and they are immaterial, invisible, and unimpeded, with a single defining characteristic, in that they are without defining characteristics. “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལས་ཀྱང་བཙལ་བར་མི་བྱ། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་།
en: Moreover, Kauśika, bodhisattva great beings should not seek the perfection of wisdom even in the sense fields, the sensory elements, or the links of dependent origination.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: Nor should they seek it in the perfections, the aspects of emptiness, the factors conducive to enlightenment, {Ki.

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལས་ཀྱང་བཙལ་བར་མི་བྱ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་གཞན་དུ་ཡང་བཙལ་བར་མི་བྱའོ།
en: II-III: 29} the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, or in [any of the fruits and realizations], up to and including all-aspect omniscience.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་གང་ཡིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གང་ཡིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དང་། བཙལ་བ་གང་ཡིན་པའི་ཆོས་དེ་དག་ཐམས་ཅད་ནི་ལྡན་པ་ཡང་མ་ཡིན་མི་ལྡན་པ་ཡང་མ་ཡིན། གཟུགས་མེད་པ། བལྟར་མེད་པ།
en: If you ask why, Kauśika, it is because all those phenomena—be they ‘physical forms,’ be they ‘all-aspect omniscience’ [and so forth], be they ‘bodhisattvas,’ be they ‘the perfection of wisdom,’ or be they ‘the act of seeking’—are neither conjoined nor disjoined, and they are immaterial, invisible, and unimpeded, with a single defining characteristic, in that they are without defining characteristics. “

source: ཐོགས་པ་མེད་པ། མཚན་ཉིད་གཅིག་པ་སྟེ། འདི་ལྟར་མཚན་ཉིད་མེད་པའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་གཟུགས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན།
en: If you ask why, Kauśika, it is because physical forms are not the perfection of wisdom.

source: གཟུགས་ལས་གུད་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་དོ།
en: Nor indeed is the perfection of wisdom anything other than physical forms.

source: །གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན།
en: The real nature of physical forms is not the perfection of wisdom.

source: གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་ལས་གུད་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་དོ།
en: Nor indeed is the perfection of wisdom anything other than the real nature of physical forms.

source: །གཟུགས་ཀྱི་ཆོས་ཉིད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན།
en: The reality of physical forms is not the perfection of wisdom.

source: གཟུགས་ཀྱི་ཆོས་ཉིད་ལས་གུད་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་དོ།
en: Nor indeed is the perfection of wisdom anything other than the reality of physical forms. “

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན།
en: Feelings, perceptions, formative predispositions, and consciousness are not the perfection of wisdom.

source: རྣམ་པར་ཤེས་པ་ལས་གུད་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་དོ།
en: Nor indeed is the perfection of wisdom anything other than consciousness [and so forth].

source: །རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན།
en: The real nature of consciousness [and so forth] is not the perfection of wisdom.

source: རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་ལས་གུད་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་དོ།
en: Nor indeed is the perfection of wisdom anything other than the real nature of consciousness [and so forth].

source: །རྣམ་པར་ཤེས་པའི་ཆོས་ཉིད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན།
en: The reality of consciousness [and so forth] is not the perfection of wisdom.

source: རྣམ་པར་ཤེས་པའི་ཆོས་ཉིད་ལས་གུད་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་དོ། །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: Nor indeed is the perfection of wisdom anything other than the reality of consciousness [and so forth]. “

source: སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན།
en: Nor indeed is the perfection of wisdom anything other than all-aspect omniscience [and so forth].

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་གུད་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན།
en: The real nature of all-aspect omniscience [and so forth] is not the perfection of wisdom.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་ལས་གུད་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་དོ།
en: Nor indeed is the perfection of wisdom anything other than the real nature of all-aspect omniscience [and so forth].

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་ཉིད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན།
en: The reality of all-aspect omniscience [and so forth] is not the perfection of wisdom.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་ཉིད་ལས་གུད་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་དོ།
en: Nor indeed is the perfection of wisdom anything other than the reality of all-aspect omniscience [and so forth]. “

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་ཆོས་དེ་དག་ཐམས་ཅད་མེད་ཅིང་མི་དམིགས་པ་སྟེ།
en: If you ask why, Kauśika, it is because all phenomena do not exist and are not apprehensible.

source: དེ་ལྟར་ཆོས་ཐམས་ཅད་མེད་ཅིང་མི་དམིགས་པས་ན་གཟུགས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན།
en: Since all phenomena do not exist and are not apprehensible, the perfection of wisdom is not physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན།
en: The perfection of wisdom is not feelings, perceptions, formative predispositions, or consciousness.

source: །རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མ་ཡིན་རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་ལས་གུད་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་དོ།
en: The perfection of wisdom is not the real nature of consciousness [and so forth].

source: རྣམ་པར་ཤེས་པའི་ཆོས་ཉིད་ལས་གུད་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་དོ།
en: II-III: 30} Nor indeed is the perfection of wisdom anything other than the reality of consciousness [and so forth]. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན།
en: The perfection of wisdom is not [the fruits and realizations], up to and including all-aspect omniscience.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་གུད་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་དོ།
en: Nor indeed is the perfection of wisdom anything other than all-aspect omniscience [and so forth].

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན།
en: The perfection of wisdom is not the real nature of all-aspect omniscience [and so forth].

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། གནས་བརྟན་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཆེ་བ་སྟེ།
en: Then Śakra, mighty lord of the gods, said to the elder Subhūti, “Blessed Subhūti, this perfection that bodhisattva great beings have is great.

source: འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: Such is the perfection of wisdom!

source: །བཙུན་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཚད་མེད་པ་སྟེ།
en: Blessed Subhūti, this perfection that bodhisattva great beings have is immeasurable.

source: །བཙུན་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མཐའ་ཡས་པ་སྟེ།
en: Blessed Subhūti, this perfection that bodhisattva great beings have is infinite.

source: །དེ་ལ་བསླབས་ཤིང་རྒྱུན་དུ་ཞུགས་པ་རྣམས་ཀྱིས་ནི། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་བོ། །འཐོབ་བོ། །ཐོབ་པར་འགྱུར་རོ། །ལན་ཅིག་ཕྱིར་འོང་བ་དང་།
en: Training in it, those who enter the stream to nirvāṇa have attained, will attain, and are attaining the fruit of entering the stream to nirvāṇa.

source: ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་རྣམས་ཀྱིས་ནི། དགྲ་བཅོམ་པ་ཉིད་ཐོབ་བོ། །འཐོབ་བོ། །ཐོབ་པར་འགྱུར་རོ།
en: Those who are destined for only one more rebirth, those who are no longer subject to rebirth, and those who are arhats have attained, will attain, and are attaining arhatship [and those other fruits].

source: །རང་སངས་རྒྱས་རྣམས་ནི་རང་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་སོ། །མངོན་པར་འཚང་རྒྱའོ། །མངོན་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: Those who are pratyekabuddhas have awakened, are awakening, and will awaken to individual enlightenment.

source: །དེ་ལ་བསླབས་ཤིང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱས། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: Training in it, bodhisattva great beings have brought beings to maturity, refined the buddhafields, and then attained, will attain, and are attaining consummate buddhahood in unsurpassed, complete enlightenment.” “

source: །རབ་འབྱོར་གྱིས་སྨྲས་པ། ཀཽ་ཤི་ཀ་དེ་དེ་བཞིན་ནོ།
en: Kauśika, it is so! It is so!” replied Subhūti. “

source: །དེ་དེ་བཞིན་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཆེ་བ་སྟེ།
en: This perfection that bodhisattva great beings have is great.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཚད་མེད་པ་སྟེ།
en: This perfection that bodhisattva great beings have is immeasurable.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མཐའ་ཡས་པ་སྟེ།
en: This perfection that bodhisattva great beings have is infinite.

source: །དེ་ལ་བསླབས་ཤིང་རྒྱུན་དུ་ཞུགས་པ་རྣམས་ཀྱིས་ནི། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་བོ། །འཐོབ་བོ། །ཐོབ་པར་འགྱུར་རོ།
en: Training in it, those who enter the stream to nirvāṇa have attained, will attain, and are attaining the fruit of entering the stream to nirvāṇa.

source: །ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་རྣམས་ཀྱིས་ནི་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་བོ། །འཐོབ་བོ། །ཐོབ་པར་འགྱུར་རོ།
en: Those who are destined for only one more rebirth, those who are no longer subject to rebirth, and those who are arhats have attained, will attain, and are attaining arhatship [and those other fruits].

source: །རང་སངས་རྒྱས་རྣམས་ཀྱིས་ནི། རང་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་སོ། །མངོན་པར་འཚང་རྒྱའོ། །མངོན་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: Those who are pratyekabuddhas have awakened, are awakening, and will awaken to individual enlightenment.

source: །དེ་ལ་བསླབས་ཤིང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Training in it, bodhisattva great beings have brought beings to maturity, refined the buddhafields, and then attained, will attain, and are attaining consummate buddhahood in unsurpassed, complete enlightenment. “

source: །མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །ཀཽ་ཤི་ཀ་གཟུགས་རྒྱ་ཆེ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་རྒྱ་ཆེ་བ་ཡིན་ཏེ།
en: Kauśika, since physical forms are extensive, this perfection that bodhisattva great beings have is extensive.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་གཟུགས་ཀྱི་སྔོན་གྱི་མཐའ་མི་དམིགས། ཕྱི་མའི་མཐའ་མི་དམིགས། དབུས་མི་དམིགས་སོ།
en: If you ask why, Kauśika, it is because the past limit of physical forms is not apprehensible, the future limit is not apprehensible, and the intervening present is not apprehensible.

source: །ཀཽ་ཤི་ཀ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་རྒྱ་ཆེ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རྒྱ་ཆེ་བ་ཡིན་ཏེ།
en: Kauśika, since feelings, perceptions, formative predispositions, and consciousness are extensive, this perfection that bodhisattva great beings have is extensive.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་རྣམ་པར་ཤེས་པའི་སྔོན་གྱི་མཐའ་མི་དམིགས།
en: If you ask why, Kauśika, it is because the past limit of consciousness [and so forth] is not apprehensible, {Ki.

source: ཕྱི་མའི་མཐའ་མི་དམིགས། དབུས་མི་དམིགས་སོ། །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་།
en: II-III: 31} the future limit is not apprehensible, and the intervening present is not apprehensible.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་རྒྱ་ཆེ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རྒྱ་ཆེ་བ་ཡིན་ཏེ།
en: Since the sense fields, the sensory elements, the links of dependent origination, the perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, and [the fruits and realizations], up to and including all-aspect omniscience, are extensive, this perfection that bodhisattva great beings have is extensive.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྔོན་གྱི་མཐའ་མི་དམིགས། ཕྱི་མའི་མཐའ་མི་དམིགས། དབུས་མི་དམིགས་སོ།
en: If you ask why, Kauśika, it is because the past limit of all-aspect omniscience [and so forth] is not apprehensible, the future limit is not apprehensible, and the intervening present is not apprehensible.

source: །ཀཽ་ཤི་ཀ་རྣམ་གྲངས་དེས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རྒྱ་ཆེ་བ་སྟེ།
en: Kauśika, this formulation explains how the perfection that bodhisattva great beings have is extensive.

source: །ཀཽ་ཤི་ཀ་གཟུགས་ཚད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཚད་མེད་པ་སྟེ།
en: Kauśika, since physical forms are immeasurable, this perfection that bodhisattva great beings have is immeasurable.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་གཟུགས་ཀྱི་ཚད་ནི་དམིགས་སུ་མེད་དོ།
en: If you ask why, Kauśika, it is because the limits of physical forms are nonapprehensible.

source: །ཀཽ་ཤི་ཀ་འདི་ལྟ་སྟེ་དཔེར་ན། ནམ་མཁའི་ཚད་ནི་དམིགས་སུ་མེད་དོ། །ཀཽ་ཤི་ཀ་དེ་བཞིན་དུ་གཟུགས་ཀྱི་ཚད་ཀྱང་དམིགས་སུ་མེད་དོ།
en: Kauśika, just as space is nonapprehensible, in the same way, Kauśika, the limits of physical forms are also nonapprehensible.

source: །ནམ་མཁའ་ཚད་མེད་པའི་ཕྱིར་གཟུགས་ཚད་མེད་དོ།
en: Since space is immeasurable, physical forms are immeasurable.

source: །གཟུགས་ཚད་མེད་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཚད་མེད་དོ།
en: Since physical forms are immeasurable, the perfection of wisdom is immeasurable.

source: །ཀཽ་ཤི་ཀ་ཚོར་བ་ཚད་མེད་པ་དང་། འདུ་ཤེས་ཚད་མེད་པ་དང་། འདུ་བྱེད་ཚད་མེད་པ་དང་། རྣམ་པར་ཤེས་པ་ཚད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཚད་མེད་པ་སྟེ།
en: Kauśika, since feelings, perceptions, formative predispositions, and consciousness are immeasurable, this perfection that bodhisattva great beings have is immeasurable.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་རྣམ་པར་ཤེས་པའི་ཚད་ནི་དམིགས་སུ་མེད་དོ།
en: If you ask why, Kauśika, it is because the limits of consciousness [and so forth] are nonapprehensible.

source: །ཀཽ་ཤི་ཀ་འདི་ལྟ་སྟེ་དཔེར་ན། ནམ་མཁའི་ཚད་ནི་དམིགས་སུ་མེད་དོ། །ཀཽ་ཤི་ཀ་དེ་བཞིན་དུ་རྣམ་པར་ཤེས་པའི་ཚད་ནི་དམིགས་སུ་མེད་དོ།
en: Kauśika, just as space is nonapprehensible, in the same way, Kauśika, the limits of consciousness [and so forth] are also nonapprehensible.

source: །ནམ་མཁའ་ཚད་མེད་པའི་ཕྱིར་རྣམ་པར་ཤེས་པ་ཚད་མེད་དོ།
en: Since space is immeasurable, consciousness [and so forth] are immeasurable.

source: །རྣམ་པར་ཤེས་པ་ཚད་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཚད་མེད་དོ། །ཀཽ་ཤི་ཀ་སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་།
en: Since consciousness [and so forth] are immeasurable, the perfection of wisdom is immeasurable.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཚད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཚད་མེད་པ་སྟེ།
en: Kauśika, since the sense fields, the sensory elements, the links of dependent origination, the perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, and [the fruits and realizations], up to and including all-aspect omniscience, are immeasurable, this perfection that bodhisattva great beings have is immeasurable.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚད་ནི་དམིགས་སུ་མེད་དོ།
en: If you ask why, Kauśika, it is because the limits of all-aspect omniscience [and so forth] are nonapprehensible.

source: །ཀཽ་ཤི་ཀ་འདི་ལྟ་སྟེ་དཔེར་ན། ནམ་མཁའི་ཚད་ནི་དམིགས་སུ་མེད་དོ། །ཀཽ་ཤི་ཀ་དེ་བཞིན་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚད་ཀྱང་དམིགས་སུ་མེད་དོ།
en: Kauśika, just as space is nonapprehensible, in the same way, Kauśika, the limits of all-aspect omniscience [and so forth] are also nonapprehensible.

source: །ནམ་མཁའ་ཚད་མེད་པའི་ཕྱིར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཚད་མེད་དོ།
en: Since space is immeasurable, all-aspect omniscience [and so forth] are immeasurable.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཚད་མེད་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཚད་མེད་དོ། །ཀཽ་ཤི་ཀ་རྣམ་གྲངས་དེས་ན།
en: Since all-aspect omniscience [and so forth] are immeasurable, the perfection of wisdom is immeasurable.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ནི་ཚད་མེད་པ་སྟེ།
en: Kauśika, this formulation explains how the perfection that bodhisattva great beings have is immeasurable.

source: །ཀཽ་ཤི་ཀ་གཟུགས་མཐའ་ཡས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་མཐའ་ཡས་པ་སྟེ།
en: Ki.II-III: 32} “Kauśika, since physical forms are infinite, this perfection that bodhisattva great beings have is infinite.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་གཟུགས་ཀྱི་མཐའ་དང་དབུས་མི་དམིགས་སོ།
en: If you ask why, Kauśika, it is because the [past and future] limits of physical forms, and the intervening present, are nonapprehensible.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མཐའ་ཡས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་མཐའ་ཡས་པ་སྟེ།
en: Since feelings, perceptions, formative predispositions, and consciousness are infinite, this perfection that bodhisattva great beings have is infinite.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་རྣམ་པར་ཤེས་པ་མཐའ་དང་དབུས་མི་དམིགས་སོ། །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་།
en: If you ask why, Kauśika, it is because the [past and future] limits of consciousness [and so forth], and the intervening present, are nonapprehensible.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མཐའ་ཡས་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་མཐའ་ཡས་པ་སྟེ།
en: Since the sense fields, the sensory elements, the links of dependent origination, the perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the eighteen distinct qualities of the buddhas, and [the fruits and realizations], up to and including all-aspect omniscience, are infinite, this perfection that bodhisattva great beings have is infinite.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་མཐའ་དང་དབུས་མི་དམིགས་སོ།
en: If you ask why, Kauśika, it is because the [past and future] limits of all-aspect omniscience [and so forth], and the intervening present, are nonapprehensible.

source: །ཀཽ་ཤི་ཀ་རྣམ་གྲངས་དེས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་གཟུགས་མཐའ་ཡས་པ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མཐའ་ཡས་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་མཐའ་ཡས་པའི་ཕྱིར།
en: Kauśika, this formulation explains how the perfection that bodhisattva great beings have is infinite because physical forms are infinite, because feelings, perceptions, formative predispositions, and consciousness are infinite, and because [all the attributes, fruits, and realizations], up to and including all-aspect omniscience, are infinite.

source: མཐའ་ཡས་པ་སྟེ། དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: Such is the perfection of wisdom! “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་དམིགས་པ་མཐའ་ཡས་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་མཐའ་ཡས་པ་སྟེ།
en: Moreover, Kauśika, this perfection that bodhisattva great beings have is infinite because there is an infinitude of objective referents.

source: དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: Such is the perfection of wisdom!”
